Model: "model_2"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_3 (InputLayer)            [(None, 39)]         0                                            
__________________________________________________________________________________________________
dense_18 (Dense)                (None, 256)          10240       input_3[0][0]                    
__________________________________________________________________________________________________
dense_19 (Dense)                (None, 256)          65792       dense_18[0][0]                   
__________________________________________________________________________________________________
dense_20 (Dense)                (None, 256)          65792       dense_19[0][0]                   
__________________________________________________________________________________________________
dense_21 (Dense)                (None, 256)          65792       dense_20[0][0]                   
__________________________________________________________________________________________________
dense_22 (Dense)                (None, 256)          65792       dense_21[0][0]                   
__________________________________________________________________________________________________
tf_op_layer_concat_2 (TensorFlo [(None, 295)]        0           dense_22[0][0]                   
                                                                 input_3[0][0]                    
__________________________________________________________________________________________________
dense_23 (Dense)                (None, 256)          75776       tf_op_layer_concat_2[0][0]       
__________________________________________________________________________________________________
dense_24 (Dense)                (None, 256)          65792       dense_23[0][0]                   
__________________________________________________________________________________________________
dense_25 (Dense)                (None, 256)          65792       dense_24[0][0]                   
__________________________________________________________________________________________________
dense_26 (Dense)                (None, 4)            1028        dense_25[0][0]                   
==================================================================================================
Total params: 481,796
Trainable params: 481,796
Non-trainable params: 0
___________________________________________________________________________________________________